Revit 2024 API
BuiltInFailures.BendFailures.NotBentImage Property
 While making curved beam type "[Type Name]" Image elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentImage { get; }
Visual Basic
Public Shared ReadOnly Property NotBentImage As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentImage {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace